const fs = require('fs');
const path = require('path');
const low = require('lowdb');
const FileSync = require('lowdb/adapters/FileSync');
const adapter = new FileSync('./config/config.json');
const db = low(adapter);

module.exports = {
  host: "192.168.0.1",
  port: process.env.SERVER_PORT || 8001,
  http_port: process.env.HTTP_PORT || 3000,
  dist: "仙逆",
  gsLines: ["万里长城1线", "万里长城2线", "万里长城3线", "万里长城4线", "万里长城5线", "万里长城6线"],
  gs: "sy_int_gs2",        // 不配置登录服务端，配置可登录插件
  isGMAccount: 0, // 测试账号是否具有GM权限
  logPath: "./log",
  enableTrace: 1,
  enableAutoTask: 1,   //自动任务，1开0关
  delayAutoTask: 5000,
  debugOn: 1,  // 输出日志，1开0关
  loginType: 0, // 0表示客户端登录，1表示web登录
  debugWsConnect: 0, // 测试 ws 连接速度
  tempMap: 4000, // 中转地图
  combatInterval: 2000, // 战斗回合间隔
  randomWalk: 5000, // 移动随机值
  users_prefix: process.env.USERS_PREFIX || "s2", // 前缀
  users_index_num: process.env.USERS_INDEX_NUM || 4, // 数字需要多少位
  users_start: process.env.USERS_START || 1, // 创建帐号的开始值
  users_end: process.env.USERS_END || 1,// 创建帐号的结束值
  users_pass: process.env.USERS_PASS || "123456", // 机器人帐号的密码
  mail_name: process.env.MAIL_NAME || "上线福利", //新手邮件
  mail_equip: "新手装备", //邮件装备
  mail_pet: "新手宠物", //邮件宠物
  War_pet: "武极", //设置参战宠物名称
  Ride_pet: "无极熊", //设置乘骑坐骑名称
  equip_fly: "御天梭", //设置使用飞行法宝名称
  vip_type: 3,  //所有账号购买会员类型，：1：月卡。2：季卡，3：年卡
  world_Team: "刷道，副本，天地，上古，万年，1030，1010，修行，除暴，伏魔，天星，试道来",//组队喊话关键词
  //自动喊话词
  world_chat: "降妖有没有人啊半天都匹配不到，降妖拉走，降妖速度来人四等一，降妖一天拉走，刷到拉走，" +
    "刷到++++++++++++，#30刷到四缺一，刷到++++++++++++，好卡啊#67，#39，什么玩意啊，魂器怎么获得，" +
    "打金队降妖来人，什么时候试道，几线五倍几线五倍几线五倍几线五倍，谁知道几线五倍，卡的要死玩你奶啊，战神有人打不，" +
    "卡星拉走满次，#66m收变异牌子有的无限上，收神兽牌子收神兽牌子收神兽牌子，" +
    "谁抢我变异牌子#53m谁抢我变异牌子#53m谁抢我变异牌子#53m，抽奖啥也没有玩几把#67，有没有人卡星带一个有没有人卡星带一个，555满次拉走不停车不下机，" +
    "你们怎么升级那么快怎么搞得，#82平民固定队来金木，又特么没元宝了玩个鸟事，操了个蛋抢老子东西，你是个什么东西啊，" +
    "什么辣鸡服卡的一批#67什么辣鸡服卡的一批#67什么辣鸡服卡的一批#67什么辣鸡服卡的一批#67，使劲熬走大佬上位#56n，这任务咋打啊，" +
    "有没有河南老兄#56，河南人偷井盖，这个区有妹子吗，大雕萌妹#56，" +
    "笑死我了一群傻狗，唉没意思不玩了，刷本来人速度刷本来人速度刷本来人速度，刷个道都没人吗死区了吗，谁特么一直开精灵抢书啊傻逼吧，" +
    "真是玩你妈隔壁，谢谢大佬带飞，你人呢跑哪去了，搞个几把蛋啊，苹果呢来啊归队了，有人出米吗大量收，曹乃磨点我pk搞什么，来道北打死你个鳖孙，江西老表集合了，" +
    "每天都双倍这还怎么玩，有结婚的妹子吗，想听妹子唱歌，谁那么无聊刷个道还在这点pk搞得我队伍没了奶奶的，还能不能完了动不动就卡死曹了，财神来几个，" +
    "收女娲收女娲收女娲收女娲收女娲，这端能玩多久看着还行啊，尸体拉走啥都干，尸体拉走啥都干尸体拉走啥都干尸体拉走啥都干，不玩了老婆会说，这里有啥福利啊，随便来一个，" +
    "下了一会再来，牛逼啊，野外有人带一个吗，上点首饰，有打王者不，爱老虎油，牛，人还蛮多啊，妈个比了，玩新区去了辣鸡，一根毛都没有，这端人多不多，挺多的啊，组队组队，任务来人，" +
    "都在打任务没，快来组队任务了，13来人，老白几线五倍啊，通天来人一起了，固定队有人吗。，组队起来了，行动起来兄弟们，嗨起来，哈喽哈喽，主线来人一起了，帮忙带下啊兄弟们，怎么升级快啊" +
    "，这服人这么多吗，五倍几线，升级队伍有没有，找个队伍，找队伍，找升级队伍，收经验书有卖的吗，收道书经验书，收女娲石，收神兽，神兽谁有多余的，收破烂咯。收各种杂货，大家都在做什么尼，" +
    "有没有好心人带带任务，怎么升级快，交友交友，喝酒来人了，几线交友，挺多人的啊，有妹子吗，有小姐姐吗，有一起升级的没，找个帮派。，怎么升级快，出个神兽，朱雀有人要吗，收疆良卡，" +
    "收道书经验书，全天巡逻来人，巡逻来人，跑的不要来，都是什么玩意，做任务还跑，你他妈的，满次来人，天苍苍野茫茫，来个妹子，有没有妹子组队啊，队伍4等1，有没有队伍缺人啊，" +
    "找大哥带飞，全天带走，全天尸体带走，有没有要我的，哥我行不行，我改8行不，有大唐不夜城附近的吗，吃饭吃饭，吃完饭继续，我休息下，带了5个小时了，小花在不在，杀星一起了，" +
    "杀星满次，满次所有拉，一条龙带走，道北砍尾了，道北道北，山河在不在，任务，任务来人，任务一条龙，所有带走，所有，通天有一起的吗，这是全天双倍吗，全天来人，来人，" +
    "好心人帮帮忙，带带任务呗，有一起的吗，约了娱乐，娱乐，世道不知道好打不，这区人多不多，一大堆，受所有，收所有，收金币，收大米，镇魔了兄弟们，镇魔真好玩，" +
    "镇魔，老白几线啊兄弟们，老白老白，满次，满次所有，乱点什么，跑尼玛啊，什么玩意，狗仔子来道北，打勾鼻，大狗比，你他妈来啊，你行不行，跑，人真他吗的多，充值几折兄弟们，" +
    "你们谁有折扣啊，怎么充值的这服，排行榜啊，这牛逼，搞几把啊，什么玩意，行不行了，刷，刷几把啊，、跟不上啊，衣带渐宽终不悔，为伊消得人憔悴。，来人，来人打个飞机，" +
    "镇魔，娱乐了，行不行了，找队伍，找个升级，升级队伍有没有，全天在线，啦啦啦走，天长地久有时尽，此恨绵绵无绝期。，兄弟啊，真背啊，镇魔输完了，梧桐树，一声声，忧伤以终老，" +
    "不尽相思血泪抛红豆，娱乐啊，多情自古伤离别，下一句兄弟们，解气来，接起来，奥里给，萨瓦迪卡，摩西摩西，鸿雁在云鱼在水，来个妹子行不行，情难绝，改名卡真贵，" +
    "兄弟们武魂几层了，这武魂怎么计算的，怎么带不了魂器啊，怎么玩，小白，求带", //随机喊话
  buy_ruoyi_num: 1, //单次购买如意数量

  db,

  // 摆摊相关
  inventoryPosBegin: 41, // 背包起始位置
  stallPriceBase: {
    血心石: 3600000,
    火眼金睛: 3240000,
    凝香幻彩: 33333,
    天书: 4770000,
    超级归元露: 3240000,
    超级黑水晶: 4920000,
    神龙盔: 70000
  },

  stallSearch: [
    { key: "宠物_普通", extra: "name:%s;", type: 2 },
    { key: "高级首饰_玉佩_80", extra: "", type: 2 },
    { key: "装备_男帽_50", extra: "prop:str:%d-%d;", type: 2 },
    { key: "超级黑水晶_武器_50", extra: "double_hit_rate:%d-%d", type: 2 },
    { key: "天技秘笈_天技秘笈残片", extra: "", type: 2 },
    { key: "宠物道具_超级归元露", extra: "", type: 1 },
    { key: "天书_天书", extra: "", type: 1 },
    { key: "装备道具_超级黑水晶", extra: "", type: 1 },
    { key: "妖石_凝香幻彩_5", extra: "", type: 1 },
    { key: "其他道具_火眼金睛", extra: "", type: 1 },
    { key: "未鉴定装备_男帽_50", extra: "", type: 1 },
    { key: "低级首饰_玉佩_50", extra: "", type: 1 }
  ],

  goldStallSearch: [
    { key: "宠物_变异", extra: "name:%s;", type: 2 },
    { key: "高级首饰_玉佩_80", extra: "", type: 2 },
    { key: "装备_男帽_50", extra: "prop:str:%d-%d;", type: 2 }
  ],

  stallSearchPet: ["海龟", "僵尸", "松鼠", "兔子", "青蛙", "猴子", "野狗", "蛇", "狐狸", "鹰"],

  goldStallSearchPet: ["伶俐鼠", "笨笨牛", "威威虎", "跳跳兔", "酷酷龙", "花花蛇", "溜溜马", "咩咩羊", "帅帅猴", "蛋蛋鸡", "乖乖狗", "招财猪"],

  stallReqList: ["宠物道具_超级归元露", "天书_天书", "装备道具_超级黑水晶", "妖石_凝香幻彩_5", "其他道具_火眼金睛", "未鉴定装备_男帽_50", "低级首饰_玉佩_50"],

  goldStallReqList: ["宠物_变异", "高级首饰_玉佩_80", "装备_男帽_50"],

  walkAndFlyRoutes: {
    circleNum: 2, // -1 无限循环 0 不循环 >0 循环次数
    routes: [
      // delayTime 对应操作执行时间
      { cmd: "cmd_teleport", delayTime: 2, map_id: 5000, x: 95, y: 64 },
      { cmd: "cmd_teleport", delayTime: 5, map_id: 1000, x: 86, y: 85 },
      { cmd: "cmd_multi_move_to", delayTime: 10, map_id: 1000, destPos: [22, 108] }
    ]
  },

  loadNames: function () {
    try {
      let maleRawData = fs.readFileSync(path.join(__dirname, 'male_names.json'));
      this.maleNames = JSON.parse(maleRawData);

      let femaleRawData = fs.readFileSync(path.join(__dirname, 'female_names.json'));
      this.femaleNames = JSON.parse(femaleRawData);

      console.log("初始化角色名称列表");
    } catch (error) {
      console.error("读取名字文件出错:", error);
    }
  },

  // 行走到初始点路线
  birthRoutes: {
    mapId: 1000,
    destPos: [23, 107]
  },

  // 行走到李总兵路线
  lizongbingRoutes: {
    mapId: 5000,
    destPos: [165, 60]
  },

  walkPath: {
    "1000": [
      [{ x: 67 }, { y: 72 }],
      [{ x: 94 }, { y: 90 }, { x: 67 }, { y: 72 }]
    ]
  },

  // 地图随机行走
  randomWalkRoutes: {
    5000: {
      interval: 2, // 行走时间间隔最大值（秒）
      initNode: {
        // 初始过图点
        node: 1,
        pos: { x: 95, y: 64 }
      },
      nodes: {
        1: {
          // 初始位置
          2: [109, 75], // 目的地 2 坐标
          3: [83, 46],
          4: [61, 77],
          5: [100, 55]
        },
        2: {
          // 活动大使
          1: [95, 64],
          8: [135, 81],
          9: [89, 94],
          10: [155, 93],
          11: [138, 111]
        },
        3: {
          // 董老头
          1: [94, 63],
          6: [67, 35],
          7: [76, 26]
        },
        4: {
          // 厉北七
          1: [95, 64],
          2: [109, 75]
        },
        5: {
          // 集市管理员
          2: [109, 75]
        },
        6: {
          // 乞丐
          3: [83, 46],
          4: [61, 77]
        },
        7: {
          // 杂货店老板
          3: [83, 46]
        },
        8: {
          // 帮派使者
          2: [109, 75],
          15: [165, 60]
        },
        9: {
          // 钱大富
          2: [109, 75]
        },
        10: {
          // 攻城战管理员
          2: [109, 75],
          5: [100, 55],
          8: [135, 81],
          11: [138, 111],
          12: [191, 105],
          13: [199, 119],
          14: [146, 74]
        },
        11: {
          // 神算子
          2: [109, 75],
          10: [155, 93]
        },
        12: {
          // 守护天神
          10: [155, 93]
        },
        13: {
          // 守城士兵
          10: [155, 93]
        },
        14: {
          // 段铁心
          10: [155, 93]
        },
        15: {
          // 李总兵
          10: [155, 93]
        }
      }
    }
  }
};
